Tekla Open API Reference for Tekla Structures 2025
Identifier Constructor
Overload List
Name | Description
Identifier()
 Constructs an empty identifier.
Identifier(Guid)
 Constructs an identifier with the given GUID.
Identifier(Int32)
 Constructs an identifier with the given ID.
Identifier(String)
 Constructs an identifier with the given GUID string.
Top
See Also
Reference
Identifier Class
Tekla.Structures Namespace